In [1]:
#notebook for Sp20 Haas SQL next steps

In [61]:
import pandas as pd
import sqlalchemy
!pip install -U pandasql
import pandasql as ps

Requirement already up-to-date: pandasql in /srv/app/venv/lib/python3.6/site-packages
Requirement already up-to-date: sqlalchemy in /srv/app/venv/lib/python3.6/site-packages (from pandasql)
Requirement already up-to-date: pandas in /srv/app/venv/lib/python3.6/site-packages (from pandasql)
Requirement already up-to-date: numpy in /srv/app/venv/lib/python3.6/site-packages (from pandasql)
Requirement already up-to-date: pytz>=2017.2 in /srv/app/venv/lib/python3.6/site-packages (from pandas->pandasql)
Requirement already up-to-date: python-dateutil>=2.6.1 in /srv/app/venv/lib/python3.6/site-packages (from pandas->pandasql)
Requirement already up-to-date: six>=1.5 in /srv/app/venv/lib/python3.6/site-packages (from python-dateutil>=2.6.1->pandas->pandasql)
You are using pip version 9.0.3, however version 20.0.2 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [62]:
import zipfile
from pathlib import Path

Path.cwd()

PosixPath('/home/jovyan')

In [63]:
reviews = pd.read_csv('airbnb_reviews.csv')
reviews.head(10)

,room_id,reviews,overall_satisfaction,accommodates,bedrooms,bathrooms,price,minstay
0,4897143,93,4.5,4,1,NaN,147,NaN
1,4670847,115,4.5,4,1,NaN,137,NaN
2,13636171,xxx,0.0,2,1,NaN,41,NaN
3,18948580,xxx,0.0,3,1,NaN,42,NaN
4,4347535,xxx,0.0,1,1,NaN,400,NaN
5,6750199,4,5.0,2,1,NaN,145,NaN
6,11461771,8,4.0,14,1,NaN,138,NaN
7,259622,125,4.5,4,1,NaN,90,NaN
8,785901,78,4.5,4,1,NaN,90,NaN
9,786506,83,4.5,4,1,NaN,90,NaN

In [64]:
information = pd.read_csv('airbnb_information.csv')
information.head(10)

,room_id,host_id,room_type,country,city,neighborhood,latitude,longitude,location
0,4897143,22931450,Shared room,NaN,San Francisco,North Beach,37.799263,-122.404322,0101000020E610000069C36169E0995EC091F3FE3F4EE6...
1,4670847,22931450,Shared room,NaN,San Francisco,North Beach,37.798920,-122.404085,0101000020E610000077F35487DC995EC0670FB40243E6...
2,13636171,33663709,Shared room,NaN,San Francisco,Financial District,37.792234,-122.393991,0101000020E6100000C6FA062637995EC0BF6378EC67E5...
3,18948580,130037991,Shared room,NaN,San Francisco,South of Market,37.780509,-122.393418,0101000020E610000018EAB0C22D995EC0E99D0AB8E7E3...
4,4347535,3344775,Shared room,NaN,San Francisco,Western Addition,37.770644,-122.436452,0101000020E610000086915ED4EE9B5EC0E76D6C76A4E2...
5,6750199,25714209,Shared room,NaN,San Francisco,Downtown/Civic Center,37.785847,-122.416518,0101000020E6100000800C1D3BA89A5EC071546EA296E4...
6,11461771,9744251,Shared room,NaN,San Francisco,Downtown/Civic Center,37.782079,-122.421775,0101000020E61000004ED1915CFE9A5EC0B7F1272A1BE4...
7,259622,329072,Shared room,NaN,San Francisco,Financial District,37.794410,-122.404725,0101000020E6100000E9B7AF03E7995EC0C4CE143AAFE5...
8,785901,329072,Shared room,NaN,San Francisco,Financial District,37.793125,-122.404429,0101000020E610000074232C2AE2995EC0EC51B81E85E5...
9,786506,329072,Shared room,NaN,San Francisco,Financial District,37.792597,-122.403395,0101000020E6100000AD174339D1995EC030F488D173E5...

In [65]:
#Select, From, Where
q1 = """SELECT room_id FROM reviews WHERE overall_satisfaction = 3"""
print(ps.sqldf(q1, locals()))

    room_id
0  18947485
1  12973719

In [57]:
#Group by, Having

In [ ]:
#Order by, Limit

In [58]:
#Joins